In [16]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [3]:
df.memory_usage()

Index    128
col1      32
col2      32
col3      32
dtype: int64

In [7]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df['col2'].nunique() # quantos valores únicos existem na coluna

3

In [9]:
df['col2'].value_counts() # mostra os valores únicos e a contagem de aparição dos mesmos

444    2
555    1
666    1
Name: col2, dtype: int64

In [10]:
def comp(x):
    return x ** 2 + 3

In [11]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df['col1'].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [13]:
df['col1_calc'] = df['col1'].apply(comp)

In [14]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [15]:
df['col1'].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [17]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df['col1'].sum()

10

In [20]:
df['col1'].mean()

2.5

In [22]:
df['col1'].product() # multiplicação dos valores em sequência

24

In [23]:
df['col1'].std() # desvião padrão

1.2909944487358056

In [24]:
df['col1'].max()

4

In [25]:
df['col1'].min()

1

In [27]:
df['col1'].idxmax() # index com maior valor

3

In [28]:
df['col1'].idxmin() # index com menor valor

0

In [31]:
df[df['col2'] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [32]:
df[df['col2'] == 444]['col1'].sum()

5

In [33]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [35]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [37]:
dict_map = {'one': '1', 'two': '2'}

In [38]:
df['B'].map(dict_map)

0    1
1    1
2    2
3    2
4    1
5    1
Name: B, dtype: object

In [39]:
df['E'] = df['B'].map(dict_map)

In [40]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [42]:
df.pivot_table(index='A', columns='B', values='D') # reorganiza os nossos dados de acordo com as especificações passadas

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0